/*!
@page Licence ライセンスについて

  SDXフレームワークはわりと規約の緩いライブラリです。<BR>
ライセンス表記も場合によっては必要ありません<BR>
<HR>
<B>無保証</B><BR>
  SDXフレームワークを使用して発生したいかなる問題に対して作者は責任を負いません。<BR>
バグや不備に対してもそれを訂正する義務を負いません。
<HR>
<B>利用に関して</B><BR>
  個人・企業、商用・非商用問わず、使用制限はありません。<BR>
２次著作物（ライブラリを使用して作成したゲーム等）のソースコードを要求する事はありません。<BR>
SDXフレームワーク自体の改造についても自由に行ってかまいません。
<HR>
<B>再配布について</B><BR>
  SDXフレームワークの再配布は自由に行えます。<BR>
その際は出展を明記して下さい。
<HR>
<B>ソースコードの公開</B>\n
  SDXフレームワークを改造したソースコードを公開する場合。<BR>
このライセンスと同じライセンスを適用して下さい。
<HR>
<B>利用者のライセンス表記</B><BR>
  ライブラリを使って作成したソフトウェアを公開する場合、付属のドキュメント等にライセンスを表示する必要がある場合があります。<BR>
タイトル画面やエンディングやパッケージに表示するような義務はありません。<BR>

内部で使用するライブラリを切り替えられるので、使用したライブラリのライセンスを適用して下さい。

<B>DXLIB</B><BR>
DX Library Copyright (C) 2001-2013 Takumi Yamada.

ここに書いてある事にしたがって下さい<BR>
http://homepage2.nifty.com/natupaji/DxLib/dxlicense.html
<BR>
GetRandと物理演算は使用していません。

<B>SDL</B><BR>
zlibライセンスなので、実行形式で配布する場合、表記は特に必要ありません。<BR>
詳しくはここを参照：<BR>
http://www.libsdl.org/license.php
<HR>
<B>ソースコードを配布する場合は必要</B><BR>
SDX Frame Work<BR>
URL:http://sourceforge.jp/projects/dxframework/simple/
<BR>
<BR>
※二次著作物の場合、表示義務はありませんが、この表示をしてもかまいません。<BR>
*/